---
kind: method
id: M:Autodesk.Revit.DB.IFC.RoofComponents.GetAreasOfCurveLoops
source: html/1701b57d-9a83-16ad-7c64-ac244475ee83.htm
---
# Autodesk.Revit.DB.IFC.RoofComponents.GetAreasOfCurveLoops Method

The areas of CurveLoops of roof slabs.

## Syntax (C#)
```csharp
public IList<double> GetAreasOfCurveLoops()
```